#include <stdio.h>
#include <stdlib.h>

/**
*	假设初始化 Max 的值是最大的
*	Max = i 在每次循环中加1 然后用 Max 去循环和 j 比较
*	如果 j 大于 Max 就交换位置
*	
*	Max = a[0] = 1 | j = i+1 = 2 | = 2 1
*	内循环第一次最终结果：2,1,3,4,5,6,7,8,9,0
*	内循环第二次最终结果：3,1,2,4,5,6,7,8,9,0
*	外循环第一次最终结果：9,1,2,3,4,5,6,7,8,0
*	外循环第二次最终结果：9,8,1,2,3,4,5,6,7,0
*	外循环第三次最终结果：9,8,7,1,2,3,4,5,6,0
* 
*	总结：
*	选择排序法 按住一个位置不动 循环出一个最大值
*	就好比打擂台 1挑全部 挑完一个再进行下一个
*	
*/

void main34() {

	int a[10] = { 1,2,3,4,5,6,7,8,9,0 };

	int Max = 0;

	for (int i = 0; i < 10 - 1; i++) {	// 最后剩余一个数肯定最小就不用比较了 所以减一
		Max = i;
		for (int j = i + 1; j < 10; j++) {
			if (a[Max] < a[j]) {
				int team = a[j];
				a[j] = a[Max];
				a[Max] = team;
			}
		}

		/* 逐步分析结果 */
		for (int i = 0; i < 10; i++) {
			printf(" %4d", a[i]);
		}
		printf("\n");

	}

	printf("------------- 最终结果 ---------------\n");

	for (int i = 0; i < 10; i++) {
		printf("a 的值为：%d\n", a[i]);
	}

	system("pause");
}